In [1]:
import pandas as pd

In [2]:
#Load the drive helper and mount
from google.colab import drive

#This will prompt for authorization
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
!ls "/content/drive/My Drive/ML/CSBS/Naive_Bayes_1"

Naive_Bayes_sklearn.ipynb		 titanic.csv
spam_email_classification_sklearn.ipynb  Untitled0.ipynb

In [4]:
df=pd.read_csv("/content/drive/My Drive/ML/CSBS/Naive_Bayes_1/titanic.csv")

In [5]:
df.head(2)

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1

[2 rows x 12 columns]

###Assumption:Make a naive assumption that features such as gender, class,  age,cabin, fare etc.  are independent of each other

In [6]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Pclass  Gender   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [7]:
# 1-Survived 0-not Survived
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [ ]:
#inputs.Gender = inputs.Gender.map({'male': 1, 'female': 2})

In [9]:
dummies = pd.get_dummies(inputs.Gender)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass  Gender   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

The gender and male columns
 may now be dropped,  as we now used the dummy variable trap theory.

In [11]:
inputs.drop(['Gender','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
#identify columns having missing values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [14]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [18]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [19]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [20]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [21]:
model.score(X_test,y_test)

0.7430167597765364

In [22]:
X_test[0:10]

     Pclass        Age     Fare  female
58        2   5.000000  27.7500       1
260       3  29.699118   7.7500       0
76        3  29.699118   7.8958       0
464       3  29.699118   8.0500       0
601       3  29.699118   7.8958       0
828       3  29.699118   7.7500       0
539       1  22.000000  49.5000       1
233       3   5.000000  31.3875       1
433       3  17.000000   7.1250       0
350       3  23.000000   9.2250       0

In [23]:
y_test[0:10]

58     1
260    0
76     0
464    0
601    0
828    1
539    1
233    1
433    0
350    0
Name: Survived, dtype: int64

In [24]:
model.predict_proba(X_test[:10])

array([[0.16423179, 0.83576821],
       [0.97165546, 0.02834454],
       [0.97168033, 0.02831967],
       [0.97170605, 0.02829395],
       [0.97168033, 0.02831967],
       [0.97165546, 0.02834454],
       [0.04285744, 0.95714256],
       [0.31482766, 0.68517234],
       [0.96546196, 0.03453804],
       [0.96934612, 0.03065388]])

In [26]:
# pclass, Age, Fare, Gender
test = [[1,23.000000,13.2750,0]]
# test = X_test
a = model.predict(test)
if a[0] ==0:
    print("Not Survived")
else:
    print("Survived")
# print(X_test)

Not Survived

####Calculate the score using Cross Validation

In [27]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.81818182, 0.79020979, 0.77464789, 0.76760563, 0.77464789])